# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv7-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4

   [-1, 1, Sim_DFC, [96, 32] ], # 2

   [-1, 1, MP, []],  # 3-P3/8
   [-1, 1, Sim_DFC, [128, 64] ], # 4

   [-1, 1, MP, []],  # 5-P4/16
   [-1, 1, Sim_DFC, [384, 128] ], # 6

   [-1, 1, MP, []],  # 7-P5/32
   [-1, 1, Sim_DFC, [768, 256]], # 8
  ]
# YOLOv7-tiny head
head:
  [ [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -2, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, SP, [ 5 ] ],
    [ -2, 1, SP, [ 9 ] ],
    [ -3, 1, SP, [ 13 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ [ -1, -7 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],  # 17

    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 6, 1, Conv, [ 128, 1, 1 ] ], # route backbone P4
    [ [ -1, -2 ], 1, BiFPN_Add2, [ 128, 128 ] ],

    [ -1, 1, Conv, [ 64, 1, 1 ] ],
    [ -2, 1, Conv, [ 64, 1, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],  #        27                    47

    [ -1, 1, Conv, [ 64, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 4, 1, Conv, [ 64, 1, 1 ] ], # route backbone P3
    [ [ -1, -2 ], 1, BiFPN_Add2, [ 64, 64 ] ],

    [ -1, 1, Conv, [ 32, 1, 1 ] ],
    [ -2, 1, Conv, [ 32, 1, 1 ] ],
    [ -1, 1, Conv, [ 32, 3, 1 ] ],
    [ -1, 1, Conv, [ 32, 3, 1 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 64, 1, 1 ] ],  # 57

    [ -1, 1, Conv, [ 128, 3, 2 ] ],
    [ [ -1, 27, 5 ], 1, BiFPN_Add3, [ 128, 128 ] ],  #                     3

    [ -1, 1, Conv, [ 64, 1, 1 ] ],
    [ -2, 1, Conv, [ 64, 1, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],  # 65

    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, 17 ], 1, BiFPN_Add2, [ 256, 256 ] ],

    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -2, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],  # 73

    [ 37, 1, Conv, [ 128, 3, 1 ] ],
    [ 45, 1, Conv, [ 256, 3, 1 ] ],
    [ 53, 1, Conv, [ 512, 3, 1 ] ],

    [ [ 54,55,56 ], 1, Detect, [ nc, anchors ] ],   # Detect(P3, P4, P5)
  ]